Repository: wp-plugins/wp-blackcheck
Catalog: languages/wp-blackcheck-*.po
Languages: de, sq

source: WP-BlackCheck - Settings
de: WP-BlackCheck - Einstellungen
sq: Paneli i kontrolli i WP-Blackcheck

source: Welcome to the settings page for WP-BlackCheck. You are able to configure the plugin to your needs.
de: Willkommen auf der Seite für die Einstellungen des WP-BlackCheck Plugins. Hier lässt sich das Verhalten des Plugins auf deine Bedürfnisse anpassen.
sq: Mirë se vini te paneli i kontrollit per WP-Blackcheck. Këtu mund të konfiguroni plugin-in sipas nevojave tuaja.

source: For more information visit <a href="%s" target="_blank">this page</a>.
de: Mehr Informationen erhälst du auf <a href="%s" target="_blank">dieser Seite</a>.
sq: Për më shumë informacione vizitoni <a href="%s" target="_blank">këtë faqe</a>.

source: If you found a bug, please report it at <a href="%s" target="_blank">this page</a>.
de: Wenn du einen Fehler gefunden hast, bitte melde ihn auf <a href="%s" target="_blank">dieser Seite</a>.
sq: Nëse gjeni ndonjë gabim, raportojeni te <a href="%s" target="_blank">kjo faqe</a>.

source: Settings updated.
de: Einstellungen aktualisiert.
sq: Ndryshimet u ruajtën.

source: Settings
de: Einstellungen
sq: Menaxhimi i pluginit

source: Blacklist settings:
de: Blacklist Einstellungen:
sq: Menaxhimi i Listës së Zezë:

source: Number of IPs to report at once:
de: Anzahl der pro Durchlauf gemeldeten IPs:
sq: Numri i IP për të raportuar në të njëjtën kohë (njëherazi):

source: Enter -1 to report all the IPs at once, disabling the limit.
de: Trage -1 ein um alle IPs auf einmal zu melden.
sq: Shkruaj -1 për ti raportuar të gjitha IP-t, kështu e heq kufizimin e numrave te IP-ve që mund të raportosh njëherazi.

source: Purge spam comments older than 2 weeks:
de: Lösche Spam-Kommentare die älter als 2 Wochen sind:
sq: Fshij komentet spam më të vjetra se dy javë:

source: Show update notice:
de: Zeige Hinweis bei neuen Updates:
sq: Më njofto kur ka axhornime të pluginit.

source: Notify on new (spam) comments:
de: Benachrichtigen bei neuen (Spam-) Kommentaren:
sq: Më njofto kur ka komente spam të reja.

source: Misc Spam prevention functions:
de: Verschiedene Spam-Bekämpfungs-Methoden:
sq: Disa funksione për parandalimin e spam-it:

source: Block spammers who have 3 comments in your queue during the last 12 hours:
de: IP abweisen, wenn schon 3 Spam-Kommentare innerhalb der letzten 12 Stunden davon eingingen:
sq: Blloko spamerat që kanë 3 komente gjatë 12 orëve të fundit:

source: Do not accept bbCode-Links:
de: Keine bBCode-Links akzeptieren:
sq: Mos prano komente që kane lidhje interneti në kodin bbCode:

source: Automatically report IPs that try to send bbCode-Links:
de: Automatisch IPs melden, die bbCode-Links verwenden:
sq: Raporto automatikisht IP-të që mundohen të dërgojnë lidhje në kodin bbCode:

source: Use speed-limit for comments (Check keystrokes per second):
de: Geschwindigkeitsbegrenzung für Kommentare (Überprüfe Tastenanschläge pro Sekunde):
sq: Kontrollo shpejtësinë e të shkruarit të komenteve (Kontrollo sa butona shtypen në sekond):

source: Automatically report IPs that break speed-limits:
de: Automatisch IPs melden, die zu schnell posten:
sq: Raporto automatikisht IP-të që e tejkalojnë shpejtësinë e shkrimit të komentit:

source: Block comments having too many links:
de: Blockiere Kommentare die zuviele Links haben:
sq: Blloko komentet që kanë shumë lidhje interneti në brendësi:

source: Maximum number of links:
de: Maximale Anzahl von Links:
sq: Maksimumi i lidhjeve brenda komentit:

source: Pingback / Trackback Settings:
de: Pingback / Trackback Einstellungen:
sq: Menaxhimi i Pingback / Trackback:

source: Check Trackbacks against Blacklist (<i>not recommended</i>):
de: Trackbacks gegen die Blacklist prüfen (<i>nicht empfehlenswert</i>):
sq: Kontrollo Trackback-et me Listën e Zezë (<i>nuk këshillohet</i>):

source: Validate Trackbacks
de: Verifiziere Trackbacks
sq: Pranoji vetë Trackback-et

source: Statistics:
de: Statistika:
sq: Statistikat:

source: Show statistics on the dashboard:
de: Statistik am Dashboard anzeigen:
sq: Trego statistikat te paneli i kryesor:

source: Reset WP-BlackCheck stats
de: WP-BlackCheck Statistik zurücksetzen
sq: Fshiji statistikat e WP-BlackCheck

source: Reset Akismet stats
de: Akismet Statistik zurücksetzen
sq: Fshiji statistikat e Akismet

source: Factory Reset
de: Auf Werkseinstellungen zurücksetzen
sq: Ktheji opcionet në origjinal

source: Drop all your custom settings and revert to the defaults.
de: Alle Einstellungen verwerfen und auf die Standardwerte zurücksetzen.
sq: Fshiji të gjitha ndryshimet që keni bërë dhe kthejini sic ishin në fillim.

source: Update Settings
de: Einstellungen speichern
sq: Ruani ndryshimet

source: Frequently Asked Questions (FAQ):
de: Häufig gestellte Fragen (FAQ):
sq: Pyetjet e shpeshta (PESH):

source: If the number of messages in the Spam-Queue is very high, the script times out.
de: Wenn die Anzahl der Spam-Kommentare zu hoch sind, gibt es einen Fehler vom Webserver.
sq: Nëse numri i komenteve spam është i lartë, plugin-i bllokohet.

source: Decrease the number of IPs being reported at once. The number you are reporting at once depends on your hosting environment.
de: Reduziere die Anzahl der pro Durchlauf gemeldeten IP-Adressen. Die Anzahl der pro Durchlauf gemeldeten Adressen hängt von deiner Hosting-Umgebung ab.
sq: Ulni numrin e IP-ve që raportohen njëherazi. Ky numër varet nga sa i fortë është hosti juaj.

source: Trackbacks do not work since WP-BlackCheck checks them.
de: Alle Trackbacks werden von WP-BlackCheck abgefangen.
sq: Që kur instalova WP-BlackCheck, Trackback-et nuk punojnë më.

source: As some blogs live on hosted environments it might have happened that the server got listed. Disable checking trackbacks against the blacklist.
de: Da manche Blogs auf einem Massenhoster liegen, kann es vorkommen, dass die IP auf der Liste eingetragen wurde. Deaktiviere in diesem Fall die Überprüfung gegen die Blacklist.
sq: Te disa blogje ndodh që vetë serveri të futet gabimisht te Lista e Zezë. Mos e shëno opcionin që të kërkon të kontrollosh Trackback-et me Listën e Zezë.

source: Everytime someone is trying to post a comment they see: "Slow down, cowboy! Speed kills."
de: Jedesmal wenn jemand einen Kommentar absendet sieht er: "Immer langsam mit den jungen Pferden, Cowboy."
sq: Sa herë që dikush mundohet të postojë një koment i del mesazhi: "Me ngadalë kauboj! Shpejtësia vret."

source: A hidden validation field in your comments does not show up. Your theme might be missing the wp_footer() call.
de: Ein verstecktes Formularfeld, welches zur Überprüfung verwendet wird scheint in deinem Theme nicht auf. Vielleicht fehlt der Aufruf von wp_footer()?
sq: Fusha e fshehur te formulari nuk ndodhet te faqja juaj. Mbase sepse Tema që po perdorni ju nuk ka funksionin wp_footer().

source: Another possibility is that you did set your comment-time too low.
de: Eine andere Möglichkeit ist, dass du die Geschwindigkeitsbegrenzung zu hoch eingestellt hast.
sq: Një shkak tjetër mund të jetë që te opcionet e keni bërë shume të ulët shpejtësinë e komenteve.

source: You have already submitted too many comments at once. Please wait before posting the next comment.
de: Du hast bereits zuviele Kommentare auf einmal abgegeben. Bitte warte bevor du den nächsten Kommentar abschickst.
sq: Ju keni postuar shumë komente tashmë. Ju lutem prisni para se të postoni një koment të ri.

source: Your comment was rejected because it contains <a href="http://en.wikipedia.org/wiki/BBCode">BBCode</a>. This blog does not use BBCode.
de: Dein Kommentar wurde abgewiesen, da er <a href="http://de.wikipedia.org/wiki/BBCode">BBCode</a> enthielt. Dieser Blog verwendet keinen BBCode.
sq: Komenti juaj nuk u pranua sepse përmban <a href="http://en.wikipedia.org/wiki/BBCode">BBCode</a>. Ky blog nuk e lejon kodin BBCode ne postime.

source: Slow down, cowboy! Speed kills.
de: Immer langsam mit den jungen Pferden, Cowboy.
sq: Me ngadalë kauboj! Shpejtësia vret

source: This blog has a limit of %d hyperlinks per comment.
de: Dieses Blog akzeptiert nur %d Links pro Kommentar.
sq: Ky blog ka një limit prej maksimumi %d lidhje brenda një postimi.

source: WP-BlackCheck - Statistics
de: WP-BlackCheck - Statistika:
sq: Statistikat e WP-BlackCheck

source: Welcome to the statistics page for WP-BlackCheck. This page shows information about the effectiveness of the spam prevention methods of this plugin.
de: Willkommen auf der Statistik-Seite für WP-BlackCheck. Diese Seite zeigt Informationen über die Wirksamkeit der Spam-Abwehr-Methoden dieses Plugins.
sq: Mirë se vini te faqja e statistikave të WP-BlackCheck. Kjo faqe jep informacione mbi efektivitetin e metodave të parandalimit të spam-it me anë të këtij plugin-i.

source: Reported new:
de: Neu gemeldet:
sq: Raportim i ri:

source: Already known:
de: Bekannt:
sq: Tashmë i njohur:

source: There are still some spam comments in your queue. Click <a href="index.php?page=wp-blackcheck/wp-blackcheck.php">here</a> to process the next batch.
de: Es ist weiterer Spam vorhanden. Klicke <a href="index.php?page=wp-blackcheck/wp-blackcheck.php">hier</a> um die nächste Ladung zu melden.
sq: Ka akoma komente spam në listë. Kliko<a href="index.php?page=wp-blackcheck/wp-blackcheck.php">këtu</a> për ti procesuar.

source: Nothing to report. Your spam queue is empty.
de: Nichts zu melden. Kein Spam vorhanden.
sq: Nuk ka asnjë koment spam për tu raportuar.

source: There is a new version of WP-BlackCheck available. It offers a ton of new features.
de: Es ist eine neue WP-BlackCheck Version verfügbar. Es gab einige große Veränderungen.
sq: Ka dalë një version i ri i WP-BlackCheck që ofron shumë opcione të reja!

source: There is a new version of WP-BlackCheck available which offers some enhancements!
de: Es ist eine neue WP-BlackCheck Version verfügbar welche einige Verbesserungen bietet!
sq: Ka dalë një versioni i ri i WP-BlackCheck që ka disa përmirësime nga versioni i mëparshëm!

source: There is a new version of WP-BlackCheck available which fixes some bugs!
de: Es ist eine neue WP-BlackCheck Version verfügbar in welcher einige Fehler behoben wurden!
sq: Ka dalë një version i ri i WP-BlackCheck që ka disa rregullime të gabimeve të versionit të mëparshëm!

source: Your WordPress installation does not meet the minimum requirements for running WP-BlackCheck!
de: Deine WordPress Installation erfüllt leider nicht die Mindestvoraussetzungen um WP-BlackCheck verwenden zu können!
sq: WP-BlackCheck nuk mund të funksionojë ne versionin e Wordpress-it tuaj.

source: WP-BlackCheck needs at least PHP 5 and WordPress 2.9!
de: WP-BlackCheck braucht mindestens PHP 5 und WordPress 2.9!
sq: WP-BlackCheck ka nevojë për të paktën PHP5 dhe Wordpress 2.9!

source: Invalid request: Proxy servers do not send trackbacks or pingbacks.
de: Fehlerhafte Anfrage: Proxy Server senden weder Trackbacks noch Pingbacks.
sq: Kërkesë e papranueshme: Serverat Proxy nuk mund te dergojnë trackback-e apo pingback-e.

source: Invalid url:
de: Ungültige URL:
sq: Url jo e vlefshme:

source: Sender IP does not match trackback IP.
de: Absender-IP stimmt nicht mit der IP Adresse des Trackbacks überein.

source: Backlink not found.
de: Backlink nicht gefunden.

source: Your host is blacklisted and cannot send any trackbacks.
de: Da dein Host auf der Blacklist steht akzeptieren wir keine Trackbacks.
sq: Hosti juaj është futur në Listën e Zezë dhe nuk mund të dërgojë trackback-e.

source: The blacklist says: %s
de: Die Blacklist meint: %s
sq: Lista e Zezë thotë: %s

source: See <a href="%s">here</a> for details.
de: Siehe <a href="%s">hier</a> bezüglich weiteren Details.
sq: Shiko detajet <a href="%s">këtu</a>.

source: Report and Clean Spam
de: Spam melden und löschen
sq: Raporto dhe Pastro Spam-in

source: Blocked
de: Geblockt
sq: E bllokuar

source: Your <a href="%s">Settings</a> for WP-BlackCheck are outdated! You should update them as soon as possible!
de: Die <a href="%s">Einstellungen</a> von WP-BlackCheck sind veraltet! Du solltest sie umgehend aktualisieren!
sq: <a href="%s">Opcionet për WP-BlackCheck</a> janë te vjetra! Axhornoi sa me shpejt!

source: Process finished
de: Abgeschlossen.
sq: Procesi mbaroi
